[
    {
        "urlSquare": "",
        "urlCard": "",
        "title": "Portfolio",
        "description": "A portfolio showcasing some of the content I have created. Styled with Bootstrap and using Trade Wind font from Google Fonts. An external Javascript file is used to change the showcased content based on the users' clicks.",
        "dLink": "https://jeqp.github.io/portfolio/portfolio.html",
        "rLink": "https://github.com/JEQP/portfolio"
    },
    {
        "urlSquare": "/mixeruppersquare.jpg",
        "urlCard": "/mixerupper350x200.jpg",
        "title": "Mixer Upper",
        "description": "A dynamic webpage allowing users to search for cocktails and receive an image, ingredients list and instructions. Constructed in a team with Takuji Okubo and Tonnette Stanford. It uses Materialize, jQuery, and the Montserrat font from Google Fonts. The details for the cocktails are drawn from The Cocktail Database. My main responsibilities were to construct the API calls and link them via Javascript with the HTML elements.",
        "dLink": "https://jeqp.github.io/mixer-upper/index.html",
        "rLink": "https://github.com/JEQP/mixer-upper"
    },
    {
        "urlSquare": "/weathereyesquare.jpg",
        "urlCard": "/weathereye350x200.jpg",
        "title": "The Weather Eye",
        "description": "A weather app that detects the users location and displays local weather, browser permitting. The user can search for cities, with the searches saved in a list, and delete items from the list. Current weather displays location, date, temperature, humidity, windspeed, and UV Index, with the last one colour-coded for severity. The weather forecast is shown as an icon, and a five day forecast appears below. <br> The app uses jQuery and Bootstrap, and obtains the weather from the Open Weather Map API.",
        "dLink": "https://jeqp.github.io/the-weather-eye/",
        "rLink": "https://github.com/JEQP/the-weather-eye"
    },
    {
        "urlSquare": "/workschedsquare.jpg",
        "urlCard": "/worksched350x200.jpg",
        "title": "Work Day Schedular",
        "description": "This web based app displays segments representing the work day, and allows users to enter and store activites for each hour. The current hour is coloured red, while hours that have passed are gray and hours in the future are green. The time blocks automatically change colour based on the current time. The current date is displayed at the top of the page. The drop down menu allows the user to select any date and display the schedule for that date, including entering, storing, and retrieving activities. It runs on jQuery and Bootstrap.",
        "dLink": "https://jeqp.github.io/day-planner/",
        "rLink": "https://github.com/JEQP/day-planner"
    },
    {
        "urlSquare": "/opmsquare.jpg",
        "urlCard": "/opm350x200.jpg",
        "title": "One Page Man",
        "description": "A full stack application that lets users easily create a customised website. They can choose a theme, upload four images and create three sub-sections with title and text. The iamges are saved on third-party site Cloudinary, and the information is stored in a MySQL database. Layout uses Materialize, and the site uses Sequelize, Express, Handlebars and jQuery.",
        "dLink": "https://thawing-inlet-42364.herokuapp.com/",
        "rLink": "https://github.com/SiJBC/project2"
    },
    {
        "urlSquare": "/burgersquare.jpg",
        "urlCard": "/burger350x200.jpg",
        "title": "Eat da Burger",
        "description": "`Allows people to create hamburgers and then devour them cybernetically. The program uses an MVC architecture (model, view, controller), and utilises jQuery, Bootstrap, Handlebars, Express,and MySQL.",
        "dLink": "https://quiet-eyrie-21871.herokuapp.com/",
        "rLink": "https://github.com/JEQP/burger"
    },
    {
        "urlSquare": "/employeetrackersquare.jpg",
        "urlCard": "/employeetracker350x200.jpg",
        "title": "Employee Tracker CMS",
        "description": "This is a command line interface to allow users to interact with an employee database to view, create and update files. In the initial screen users choose to add, view, update a file, or leave the system. Uses Node.js and MySQL.",
        "dLink": "https://github.com/JEQP/Employee_Tracker",
        "rLink": "https://github.com/JEQP/Employee_Tracker"
    }
]